{
    "greeting": "Hello*,* I'm _Tommy_*.*",
    "about": "I am a full-stack web developer based in _Provo, Utah_*.*\nI am a _linguist_ by heart and a _programmer_ by trade*.*\nI love monkeys, books, and _clean code_*.*",
    "stack": [
        {
            "bullet": "<front-end />",
            "name": "React"
        },
        {
            "bullet": "{http}",
            "name": "GraphQL"
        },
        {
            "bullet": "(server)",
            "name": "Node"
        },
        {
            "bullet": "[database]",
            "name": "PostgreSQL"
        }
    ],
    "skills": [
        {
            "name": "_Front-end_ web development"
        },
        {
            "name": "_Back-end_ web development"
        },
        {
            "name": "Relational _data modeling_"
        },
        {
            "name": "_Database design_ & development"
        },
        {
            "name": "Teaching & _Mentorship_"
        }
    ],
    "work": [
        {
            "name": "Glascad",
            "subtitle": "Shop Drawing Generator",
            "description": "As a cofounding developer of Glascad, I architected a software solution for generating glass-and-glazing shop drawings, including:\n- researching the nuance of glass-and-glazing from top professionals\n- designing a database to capture the nuance of each manufacturer system\n- designing a system for inputting manufacturer information\n- writing a DXF to SVG converter for bringing AutoCAD files into the browser\n- developing and maintaining a library of React UI components\n- developing data-entry and client applications to generate simple shop drawings\n- training an intern in JavaScript & React\n- Experimenting and developing a process of test-driven-development to ensure reliability",
            "image": "Glascad"
        },
        {
            "name": "North Star",
            "subtitle": "Conference App",
            "description": "I volunteer as a Mobile Developer and Technical Lead at North Star International.\nNorth Star's conference app is used by hundreds of conference attendees each year, allowing them to preview the conference schedule and select breakout sessions to attend, as well as provide feedback once the conference is over.\nAs a new DevMountain grad in 2018, I began doing minor design updates to the app for the conference in March. Then, for the 2019 conference, I rewrote the app in React Native (originally in AngularJS/Ionic). For the upcoming 2020 conference, I'll be rolling out several upgrades to the existing app.",
            "image": "NorthStar"
        },
        {
            "name": "DevMountain",
            "subtitle": "Student Info API",
            "description": "While mentoring at DevMountain, I led a team of three jr developers to build an API for gathering and supplying statistics on student progress to management and other internal clients.",
            "image": "StudentInfo"
        }
    ],
    "links": [
        {
            "name": "LinkedIn",
            "href": "https://linkedin.com/in/thomasglowry"
        },
        {
            "name": "GitHub",
            "href": "https://github.com/tommydreamer57"
        },
        {
            "name": "Email",
            "href": "mailto:thomas@lowrysoftware.com"
        }
    ]
}